import {createReducer, on} from '@ngrx/store';
import {Region} from '../../app/region-map/region';
import {setDimension, setPeriod} from './actions';

export interface RegionsState {
    selectedDimension: 'march/april' | 'stability' | 'vulnerable';
    selectedPeriod: 'april' | 'all';
    regions: Region[];
}

export const initialState: RegionsState = {
    selectedDimension: 'march/april',
    selectedPeriod: 'april',
    regions: [
        new Region('Спб', 'Санкт-Петербург', 32, 0, 0),
        new Region('Мур', 'Мурманская область', 29, 0, 4),
        new Region('Мск', 'Мосвка', 20, 1, 0),
        new Region('Кар', 'Республика Карелия', 22, 1, 3),
        new Region('Нен', 'Ненецкий автономный округ', 25, 1, 9),
        new Region('Чук', 'Чукотский автономный округ', 97, 1, 16),
        new Region('Кам', 'Камчатская область', 92, 1, 17),
        new Region('Лен', 'Ленинградская область', 28, 2, 2),
        new Region('Новг', 'Новгородская область', 30, 2, 3),
        new Region('Воло', 'Вологодская область', 26, 2, 4),
        new Region('Арх', 'Архангельская область', 24, 2, 8),
        new Region('Коми', 'Республика Коми', 11, 2, 9),
        new Region('Ямал', 'Ямало-Ненецкий автономный округ', 89, 2, 10),
        new Region('Крас', 'Красноярский край', 24, 2, 13),
        new Region('Саха', 'Республика Саха (Якутия)', 14, 2, 15),
        new Region('Маг', 'Магаданская область', 49, 2, 16),
        new Region('Кали', 'Калининградская область', 39, 3, 0),
        new Region('Пск', 'Псковская область', 60, 3, 2),
        new Region('Твер', 'Тверская область', 69, 3, 3),
        new Region('Яро', 'Ярославская область', 76, 3, 4),
        new Region('Ива', 'Ивановская область', 37, 3, 5),
        new Region('Кос', 'Костромская область', 44, 3, 6),
        new Region('Мари', 'Республика Марий Эл', 12, 3, 7),
        new Region('Кир', 'Кировская область', 43, 3, 8),
        new Region('Пер', 'Пермский край', 59, 3, 9),
        new Region('Хан', 'Ханты-Мансийский АО', 86, 3, 10),
        new Region('Тюм', 'Тюменская область', 72, 3, 11),
        new Region('Том', 'Томская область', 70, 3, 12),
        new Region('Кем', 'Кемеровская область', 42, 3, 13),
        new Region('Ирк', 'Иркутская область', 38, 3, 14),
        new Region('Амур', 'Амурская область', 28, 3, 15),
        new Region('Хаб', 'Хабаровский край', 27, 3, 16),
        new Region('Схлн', 'Сахалинская область', 65, 3, 18),
        new Region('Смол', 'Смоленская область', 67, 4, 2),
        new Region('Калу', 'Калужская область', 40, 4, 3),
        new Region('Мос', 'Московская область', 50, 4, 4),
        new Region('Вла', 'Владимирская область', 33, 4, 5),
        new Region('Ниж', 'Нижегородская область', 52, 4, 6),
        new Region('Чув', 'Чувашская Республика', 21, 4, 7),
        new Region('Тат', 'Республика Татарстан', 16, 4, 8),
        new Region('Удм', 'Удмуртская Республика', 18, 4, 9),
        new Region('Свер', 'Свердловская область', 66, 4, 10),
        new Region('Кург', 'Курганская область', 45, 4, 11),
        new Region('Ново', 'Новосибирская область', 54, 4, 12),
        new Region('Хак', 'Республика Хакасия', 19, 4, 13),
        new Region('Бур', 'Республика Бурятия', 3, 4, 14),
        new Region('Евр', 'Еврейская автономная область', 79, 4, 15),
        new Region('Бря', 'Брянская область', 32, 5, 2),
        new Region('Орёл', 'Орловская область', 57, 5, 3),
        new Region('Тул', 'Тульская область', 71, 5, 4),
        new Region('Ряз', 'Рязанская область', 62, 5, 5),
        new Region('Мор', 'Республика Мордовия', 13, 5, 6),
        new Region('Уль', 'Ульяновская область', 73, 5, 7),
        new Region('Сам', 'Самарская область', 63, 5, 8),
        new Region('Бшк', 'Республика Башкортостан', 2, 5, 9),
        new Region('Чел', 'Челябинская область', 74, 5, 10),
        new Region('Омск', 'Омская область', 55, 5, 11),
        new Region('Ал к.', 'Алтайский край', 22, 5, 12),
        new Region('Тыва', 'Республика Тыва', 17, 5, 13),
        new Region('Заб', 'Забайкальский край', 75, 5, 14),
        new Region('При', 'Приморский край', 25, 5, 16),
        new Region('Курск', 'Курская область', 46, 6, 3),
        new Region('Лип', 'Липецкая область', 48, 6, 4),
        new Region('Там', 'Тамбовская область', 68, 6, 5),
        new Region('Пен', 'Пензенская область', 58, 6, 6),
        new Region('Сар', 'Саратовская область', 64, 6, 7),
        new Region('Орен', 'Оренбургская область', 56, 6, 8),
        new Region('Алт', 'Республика Алтай', 4, 6, 12),
        new Region('Бел', 'Белгородская область', 31, 7, 4),
        new Region('Вор', 'Воронежская область', 36, 7, 5),
        new Region('Волг', 'Волгоградская область', 34, 7, 6),
        new Region('Сев', 'Севастополь', 92, 8, 0),
        new Region('Крым', 'Республика Крым', 91, 8, 2),
        new Region('Адыг', 'Республика Адыгея', 1, 8, 3),
        new Region('Крдр', 'Краснодарский край', 23, 8, 4),
        new Region('Рос', 'Ростовская область', 61, 8, 5),
        new Region('Калм', 'Республика Калмыкия', 8, 8, 6),
        new Region('Аст', 'Астраханская область', 30, 8, 7),
        new Region('Кара', 'Карачаево-Черкесская Республика', 9, 9, 4),
        new Region('Став', 'Ставропольский край', 26, 9, 5),
        new Region('Чеч', 'Чеченская Республика', 20, 9, 6),
        new Region('Даг', 'Республика Дагестан', 5, 9, 7),
        new Region('Каб', 'Кабардино-Балкарская Республика', 7, 10, 4),
        new Region('Осет', 'Республика Северная Осетия', 15, 10, 5),
        new Region('Инг', 'Республика Ингушетия', 6, 10, 6),
    ]
};

// tslint:disable-next-line:variable-regionShortName variable-name
const _regionsReducer = createReducer(
    initialState,
    on(setDimension, (state, {dimension}) => ({
        ...state,
        selectedDimension: dimension
    })),
    on(setPeriod, (state, {period}) => ({
        ...state,
        selectedPeriod: period
    }))
    );

// tslint:disable-next-line:typedef
export function regionsReducer(state, action) {
    return _regionsReducer(state, action);
}
